Revit 2027 API
UIApplication Properties
The UIApplication type exposes the following members.
Properties
Name | Description
ActiveAddInId |  Get current active external application or external command id.
ActiveUIDocument | Provides access to an object that represents the currently active project.
Application |  Returns the database level Application represented by this UI level Application.
DrawingAreaExtents | Get the rectangle that represents the screen pixel coordinates of drawing area.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
IsViewerModeActive | Obsolete.
 Determines if Revit session is in Viewer mode.
LoadedApplications |  Returns an array of successfully loaded external applications.
MainWindowExtents | Get the rectangle that represents the screen pixel coordinates of the Revit main window.
MainWindowHandle | Get the handle of the Revit main window.
ProductIsRS |  Identifies if the current Revit product has an RS designation. Most add-ins will not need to use this information.
Top
See Also
Reference
UIApplication Class
Autodesk.Revit.UI Namespace